# Указываем базовый образ NodeJS
FROM node:alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы с зависимостями (package.json и package-lock.json)
COPY package*.json .

# Устанавливаем зависимости проекта
RUN npm install

# Копируем исходный код приложения в контейнер
COPY src/ ./src

# Устанавливаем порт, на котором должен быть запущен сервер
ENV PORT=3000

# Открываем порт 3000 для внешнего доступа
EXPOSE 3000

# Запускаем npm-скрипт для старта приложения
CMD ["npm", "start"]
